Repository: Niklan/niklan.net
Catalog: assets/translation/*.po
Languages: ru

source: Did you like it? Share it with others.
ru: Понравилось? Поделись с другими.

source: Support
ru: Поддержать

source: Niklan — freelance Drupal web-developer
ru: Niklan — фриланс Drupal веб-разработчик

source: Contact me
ru: Связаться со мной

source: I'll send a reply to the specified address.
ru: На указанный адрес я отправлю ответ.

source: The content is published under <a href="@license_url">CC-BY-SA 4.0</a> license.
ru: Содержимое публикуется на условиях лицензии <a href="@license_url">CC-BY-SA 4.0</a>.

source: Follow
ru: Отслеживать

source: Tags
ru: Метки

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Contact form
ru: Форма обратной связи

source: Hire me
ru: Нанять меня

source: Let's Talk
ru: Давайте пообщаемся

source: Let's Work Together
ru: Давайте работать вместе

source: Preview
ru: Предпросмотр

source: « First
ru: « Первая

source: ‹ Previous
ru: ‹ Назад

source: Next ›
ru: Вперёд ›

source: Last »
ru: Последняя »

source: Created
ru: Дата создания

source: @minutes min.
ru: @minutes мин.

# color scheme
source: Light
ru: Светлая

# color scheme
source: Dark
ru: Тёмная

# color scheme
source: Inherit from the system
ru: Наследовать из системы

source: Show 1 reply
ru: Показать 1 ответ

source: Find out what publications are being discussed.
ru: Узнайте какие публикации сейчас обсуждаются.

source: Supports <a href="@common_mark_url" target="_blank">CommonMark</a> syntax.
ru: Поддерживает синтаксис <a href="@common_mark_url" target="_blank">CommonMark</a>.

source: Estimated reading time
ru: Приблизительное время прочтения

source: 1 comment
ru: 1 комментарий

source: Created time
ru: Дата создания

source: Blog
ru: Блог

source: Portfolio
ru: Портфолио

source: What are we looking for?
ru: Что будем искать?

source: Search results for «%keys»
ru: Результаты поиска по запросу «%keys»

source: Enter a search query.
ru: Введите поисковый запрос.

source: No results found.
ru: Ничего не найдено.

source: Last blog posts
ru: Последние публикации в блоге

source: All posts
ru: Все публикации

source: Blog posts
ru: Публикации в блоге

source: It appears that there are no results, or you have not entered the keys to search.
ru: Кажется, что результатов нет, или вы не ввели что искать.

source: @count publication from @date
ru: @count публикация от @date

source: @count publication from @date_start to @date_end
ru: @count публикация с @date_start по @date_end

source: Hi, my name is <strong>Nikita</strong>
ru: Привет, меня зовут <strong>Никита</strong>

source: I'm a <span>freelance web developer</span>.
ru: Я <span>фриланс веб-разработчик</span>.

source: I develop websites on Drupal.
ru: Занимаюсь разработкой сайтов на Drupal.

source: Contributing to OpenSource. I write tutorials on my blog, at the same time developing a YouTube channel. Constantly trying to improve and sharpen skills.
ru: Контрибучу в OpenSource. Пишу обучающие материалы в блоге, параллельно развивая YouTube канал. Постоянно стремлюсь улучшить и отточить навыки.

source: About me
ru: О себе

source: I got interested in web development in 2006, when I got into a camp with a computer bias, where there was a group for creating simple HTML pages. I also created <a href="@repository_url" rel="nofollow noopener" target="_blank">first HTML site</a>. Since then, I started to get involved in this direction by making simple websites for myself and trying different CMS.
ru: Веб-разработкой увлёкся в 2006 году, когда попал в лагерь с компьютерным уклоном, где был кружок создания простеньких HTML страничек. Там же создал <a href="@repository_url" rel="nofollow noopener" target="_blank">первый HTML-сайт</a>. С тех пор я начал увлекаться этим направлением делая простенькие сайты для себя и пробуя различные системы.

source: In 2011 I started to study Drupal and PHP, and since 2013 I have been doing it professionally. Since then I have been providing web development services remotely from Perm.
ru: В 2011 году начал изучать Drupal и PHP, а с 2013 года заниматься этим на профессиональном уровне. С тех пор удалённо оказываю услуги по веб-разработке из г. Перми.

source: I use Drupal exclusively in my work. I think it's better to know one tool well than many and mediocre. I put the work quality on the first place, I'm concerned about the standards, I constantly study the best practices and experiences of other developers, I monitor the trends and changes in the web. I'm constantly engaged in self-study.
ru: В работе использую исключительно Drupal. Считаю, что лучше знать один инструмент хорошо, чем много и посредственно. Ставлю качество исполнения на первое место, трепетно отношусь к стандартам, постоянно изучаю лучшие практики и опыт других разработчиков, слежу за тенденциями и изменениями в вебе. Непрерывно занимаюсь самообучением.

source: Successful!
ru: Успешно!

source: Thank you, your message was successfully sent.
ru: Спасибо, ваше сообщение успешно отправлено.

source: This list of projects in which I participated as a full stack developer (backend + frontend), unless otherwise noted. It does not include small projects, projects under NDA and those in which my participation was insignificant.
ru: Здесь перечислены проекты в которых я принимал участие как full stack developer (backend + frontend), если не указано обратного. В нём отсутствуют маленькие проекты, проекты под NDA и те, в которых моё участие было несущественным.

source: In addition to commercial projects, I contribute to OpenSource (<a href="@github_url" rel="nofollow noopener" target="_blank">GitHub</a>, <a href="@drupal_url" rel="nofollow noopener" target="_blank">Drupal.org</a>) and, of course, write a <a href="@blog_url" rel="nofollow noopener" target="_blank">blog</a>. And recently, I also keep a <a href="@youtube_url" rel="nofollow noopener" target="_blank">YouTube channel</a>.
ru: Помимо коммерческих проектов контрибучу в OpenSource (<a href="@github_url" rel="nofollow noopener" target="_blank">GitHub</a>, <a href="@drupal_url" rel="nofollow noopener" target="_blank">Drupal.org</a>) и, конечно же, пишу в <a href="@blog_url" rel="nofollow noopener" target="_blank">блог</a>. А с недавних пор, ещё и веду <a href="@youtube_url" rel="nofollow noopener" target="_blank">YouTube-канал</a>.

source: Previous
ru: Предыдущий

source: Next
ru: Следующий

source: I am interested in long-term cooperation. It is more comfortable for me to work with one client for a long time, so I give priority to such proposals. I have been working with current clients for more than 5 years, therefore I do not always have free time for new projects, but I will find time to consult or advise!
ru: Я заинтересован в долгосрочном сотрудничестве. Мне комфортнее работать с одним клиентом длительное время, поэтому отдаю приоритет подобным предложениям. С текущими клиентами работаю более 5 лет, ввиду чего, не всегда имею свободное время для новых проектов, но найду время проконсультировать или подсказать!

source: My goal is to do quality.
ru: Моя цель — сделать качественно.

source: If the deadline for the project is «yesterday» - I'm not the one you're looking for. I do not create a sites «for a couple of days», and by experience I know that there is no task «there for just a couple of minutes» with your experience. I always try to find the best and most optimal solution to the problem, not the first that comes along, which will put a checkmark «done».
ru: Если срок сдачи проекта «вчера» — я не тот исполнитель. Я не делаю сайты «за пару дней», и по опыту знаю, что не бывает задач «там всего на пару минут с твоим опытом». Всегда пытаюсь найти самое оптимальное и лучшее решение задачи, а не первое попавшееся, которое позволит поставить галочку «выполнено».

source: <a href="@portfolio_url">Portfolio</a> — commercial projects that I have worked on or continue to work on.
ru: <a href="@portfolio_url">Портфолио</a> — коммерческие проекты над которыми я работал или продолжаю работать.

source: <a href="@github_url">GitHub</a> — my contribution to OpenSource.
ru: <a href="@github_url">GitHub</a> — моя контрибуция в OpenSource.

source: <a href="@drupal_url">drupal.org</a> — my profile on the official Drupal website.
ru: <a href="@drupal_url">drupal.org</a> — мой профиль на официальном сайте Drupal.

# work
source: Services
ru: Услуги

source: Website development and support on <strong>Drupal 9</strong>.
ru: Разработка и поддержка сайтов на <strong>Drupal 9</strong>.

source: Drupal theming.
ru: Вёрстка для Drupal.

source: Consultation on Drupal or an audit of your site.
ru: Консультация по Drupal или аудит вашего сайта.

source: How we'll work
ru: Как будем работать

source: If the amount of work (approximately) exceeds 10 hours:
ru: Если объём работ (примерно) превышает 10 часов:

source: Discuss the task, ToR (if available).
ru: Обсуждаем задачу, ТЗ (если имеется).

source: I invoice for 10 or more hours (at your discretion).
ru: Выставляю счёт на 10 или более часов (по вашему усмотрению).

source: I do the work on this amount of hours.
ru: Выполняю работу на данный объём часов.

source: If necessary, on completion i make and send a report on the work done.
ru: Если необходимо, по завершению составляю и высылаю отчёт о проделанной работе.

source: If everything is okay, repeat and continue.
ru: Если всё устраивает — повторяем, продолжаем.

source: Price
ru: Стоимость

source: I work with an hourly rate and consider it the best option for both parties.
ru: Я работаю с почасовой оплатой и считаю это самым оптимальным вариантом сотрудничества для обеих сторон.

source: 1 000 ₽/h
ru: 1 000 ₽/ч

source: Hi. You occasionally ask <em>«How can I support financially?»</em> or ask to add a donate button. Well, if this is about you, you've come to the right place.
ru: Привет. Вы периодически спрашиваете «Как можно поддержать финансово?» или просите добавить кнопку донатов. Штош, если это про вас, вы попали куда нужно.

source: A blog is a hobby. Donations will not affect the quality and regularity of the content. I do it when I am in the mood, time and desire.
ru: Блог — это хобби. Пожертвования не повлияют на качество и регулярность контента. Я его делаю тогда, когда есть настроение, время и желание.

source: Donations are not a goal or a motivator. Think twice, or better yet, three times before you support.
ru: Пожертвования — не цель и не мотиватор. Подумайте дважды, а лучше трижды, прежде чем поддержать.

source: If you haven't changed your mind, you can donate through <a href="@bank_url"><strong>Tinkoff Bank</strong></a>.
ru: Если вы не передумали, вы можете сделать пожертвование через <a href="@bank_url"><strong>Тинькофф Банк</a>.

source: You can email me using the form on this page or you can write to me at <a href="mailto:@email"><strong>@email</strong></a>.
ru: Можете написать мне на почту воспользовавшись формой на текущей странице, либо удобным для вас способом на <a href="mailto:@email"><strong>@email</strong></a>.

source: If it is more convenient, write directly on Telegram - <a href="@telegram_url" target="_blank" rel="nofollow noopener">@Niklan</a>. Just ask: no need to write «hello» and wait for my reaction, directly write a question; I do not listen voice messages; I do not answer calls.
ru: Если удобнее, пишите напрямую в Telegram — <a href="@telegram_url" target="_blank" rel="nofollow noopener">@Niklan</a>. Только попрошу: не нужно писать «привет» и ждать моей реакции, сразу пишите вопрос; войсы не слушаю; звонки не беру.

source: My other social media pages:
ru: Мои прочие странички в соц. сетях:

# author
source: About
ru: Об авторе

# menu
source: Contact
ru: Контакты

source: Read the blog
ru: Читать блог

source: Welcome to
ru: Добро пожаловать, на

source: Web Developer Blog
ru: Блог веб-разработчика

source: This is an author's blog about web development. In my work I use Drupal, so most publications are about Drupal CMS.
ru: Это авторский блог о веб-разработке. В работе использую Drupal поэтому большинство публикацией посвящено этой CMS.

source: Search query
ru: Поисковый запрос

source: Do search
ru: Искать

source: Subject
ru: Тема

source: Working directory
ru: Рабочая директория

source: Directory URI where content source is located. Should be a git directory.
ru: URI директории где находится исходное содержимое. Директория должна содержать git.

source: Content synchronization settings
ru: Настройки синхронизации содержимого

source: Content synchronization
ru: Синхронизация содержимого

source: Allows to configure content synchronization and track current status.
ru: Позволяет настроить синхронизацию содержимого и отслеживать текущее состояние.

source: Development version
ru: Версия для разработки

source: Site search
ru: Поиск по сайту

source: Time to read
ru: Время на чтение

source: Note
ru: Заметка

source: Tip
ru: Совет

source: Important
ru: Важно

source: Caution
ru: Осторожно

source: Error
ru: Ошибка

source: Copied!
ru: Скопировано!

source: Table of contents
ru: Содержание

source: Filter headings
ru: Фильтрация по заголовкам

source: Previous article
ru: Предыдущий материал

source: Next article
ru: Следующий материал

source: Add comment
ru: Добавить комментарий

source: Laszlo Cravensworth
ru: Ласло Крейвенсворт

source: Website version
ru: Версия сайта

source: Content version
ru: Версия содержимого

source: @count publication
ru: @count публикация

source: Open the list of publications
ru: Открыть список публикаций

source: Publications with the @name tag
ru: Материалы по теме @name

source: Buy a cup of coffee
ru: Купить чашку кофе

source: Write to Telegram
ru: Написать в Телеграм

source: Niklan.net settings
ru: Настройки сайта Niklan.net

source: About page settings
ru: Настройки страницы "Об авторе"

source: Configure an about page with an author biography and photo.
ru: Настройте страницу "Об авторе" с биографией автора и фотографией.

source: Services page settings
ru: Настройки страницы "Услуги"

source: Configure a services page with a description and an hourly rate.
ru: Настройте страницу "Услуги" с описанием и часовым тарифом.

source: Support page settings
ru: Настройки страницы "Поддержка"

source: Configure a support page with a description and a link to donate.
ru: Настройте страницу "Поддержка" с описанием и ссылкой на пожертвование.

source: Contact page settings
ru: Настройки страницы "Контакты"

source: Configure a contact page.
ru: Настройте страницу "Контакты".

source: Portfolio page settings
ru: Настройки страницы "Портфолио"

source: Configure a portfolio page.
ru: Настройте страницу "Портфолио".

source: Screenshots
ru: Скриншоты

source: Latest posts
ru: Последние публикации

source: TL;DR - ”I'd rather read a book”
ru: TL;DR — «Лучше бы книгу прочитал»

source: The most discussed
ru: Самые обсуждаемые

source: Opinion of anonymous users from the Internet
ru: Мнение анонимов из интернета

source: Markdown is supported
ru: Поддерживается Markdown

source: Comments temporarily disabled
ru: Комментарии временно отключены

source: <a href="@url" rel="noreferrer nofollow noopener" target="_blank">There is a lot of spam going on.</a> I need some time to implement tools to moderate it via Telegram and bring them back again.
ru: <a href="@url" rel="noreferrer nofollow noopener" target="_blank">Слишком много спама.</a> Нужно немного времени чтобы реализовать инструменты для модерации спама через Телеграм и вернуть их обратно.

source: Home page settings
ru: Настройки главной страницы

source: Configure the home page with an introductory text and promo cards.
ru: Настройте домашнюю страницу с вводным текстом и промо-карточками.

source: You need to provide a search query to see the results.
ru: Вы должны указать поисковый запрос чтобы увидеть результаты.

source: Nothing was found for your request.
ru: Ничего не найдено по вашему запросу.
